<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_23018" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_23018">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_23132" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_23133" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_23134" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_23135" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="Constant_23136" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="6" name="Constant_23137" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="12" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_23024" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="StringTensorUnpack_23019" type="StringTensorUnpack" version="opset15">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ShapeOf_23020" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_23021" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Constant_23022" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="Gather_23023" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Constant_23025" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Range_23026" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_23027" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Constant_23028" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="Add_23029" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="Constant_23030" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="19" name="Range_23031" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_23095" type="Const" version="opset1">
			<data element_type="u8" shape="26479" offset="32" size="26479" />
			<output>
				<port id="0" precision="U8">
					<dim>26479</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="SpecialTokensSplit_23096" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>26479</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_23098" type="Const" version="opset1">
			<data element_type="u8" shape="74" offset="26511" size="74" />
			<output>
				<port id="0" precision="U8">
					<dim>74</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="RegexSplit_23099" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>74</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_23101" type="Const" version="opset1">
			<data element_type="i32" shape="51865" offset="26585" size="207460" />
			<output>
				<port id="0" precision="I32">
					<dim>51865</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_23103" type="Const" version="opset1">
			<data element_type="i32" shape="51865" offset="234045" size="207460" />
			<output>
				<port id="0" precision="I32">
					<dim>51865</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_23105" type="Const" version="opset1">
			<data element_type="u8" shape="320780" offset="441505" size="320780" />
			<output>
				<port id="0" precision="U8">
					<dim>320780</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_23113" type="Const" version="opset1">
			<data element_type="i32" shape="50000" offset="762285" size="200000" />
			<output>
				<port id="0" precision="I32">
					<dim>50000</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_23115" type="Const" version="opset1">
			<data element_type="i32" shape="50000" offset="962285" size="200000" />
			<output>
				<port id="0" precision="I32">
					<dim>50000</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_23117" type="Const" version="opset1">
			<data element_type="u8" shape="169950" offset="1162285" size="169950" />
			<output>
				<port id="0" precision="U8">
					<dim>169950</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_23119" type="Const" version="opset1">
			<data element_type="i32" shape="50000" offset="1332235" size="200000" />
			<output>
				<port id="0" precision="I32">
					<dim>50000</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_23121" type="Const" version="opset1">
			<data element_type="i32" shape="50000" offset="1532235" size="200000" />
			<output>
				<port id="0" precision="I32">
					<dim>50000</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_23123" type="Const" version="opset1">
			<data element_type="u8" shape="136851" offset="1732235" size="136851" />
			<output>
				<port id="0" precision="U8">
					<dim>136851</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_23107" type="Const" version="opset1">
			<data element_type="i32" shape="1608" offset="1869086" size="6432" />
			<output>
				<port id="0" precision="I32">
					<dim>1608</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_23109" type="Const" version="opset1">
			<data element_type="i32" shape="1608" offset="1875518" size="6432" />
			<output>
				<port id="0" precision="I32">
					<dim>1608</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_23111" type="Const" version="opset1">
			<data element_type="u8" shape="13723" offset="1881950" size="13723" />
			<output>
				<port id="0" precision="U8">
					<dim>13723</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_23124" type="Const" version="opset1">
			<data element_type="i32" shape="1608" offset="1895673" size="6432" />
			<output>
				<port id="0" precision="I32">
					<dim>1608</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="BPETokenizer_23125" type="BPETokenizer" version="extension">
			<data unk_token="" fuse_unk="false" suffix_indicator="" end_suffix="" byte_fallback="false" cache_capacity="20000" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>51865</dim>
				</port>
				<port id="6" precision="I32">
					<dim>51865</dim>
				</port>
				<port id="7" precision="U8">
					<dim>320780</dim>
				</port>
				<port id="8" precision="I32">
					<dim>50000</dim>
				</port>
				<port id="9" precision="I32">
					<dim>50000</dim>
				</port>
				<port id="10" precision="U8">
					<dim>169950</dim>
				</port>
				<port id="11" precision="I32">
					<dim>50000</dim>
				</port>
				<port id="12" precision="I32">
					<dim>50000</dim>
				</port>
				<port id="13" precision="U8">
					<dim>136851</dim>
				</port>
				<port id="14" precision="I32">
					<dim>1608</dim>
				</port>
				<port id="15" precision="I32">
					<dim>1608</dim>
				</port>
				<port id="16" precision="U8">
					<dim>13723</dim>
				</port>
				<port id="17" precision="I32">
					<dim>1608</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_23126" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1902105" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="39" name="Constant_23128" type="Const" version="opset1">
			<data element_type="u8" shape="5" offset="1902109" size="5" />
			<output>
				<port id="0" precision="U8">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_23130" type="Const" version="opset1">
			<data element_type="u8" shape="13" offset="1902114" size="13" />
			<output>
				<port id="0" precision="U8">
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Truncate_23131" type="Truncate" version="extension">
			<data m_num_inputs="1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="U8">
					<dim>5</dim>
				</port>
				<port id="5" precision="U8">
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_23138" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="43" name="Constant_23139" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="44" name="Constant_23140" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1902127" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_23141" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1902131" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="CombineSegments_23142" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
				<port id="5" precision="I32">
					<dim>1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32" />
				<port id="10" precision="I32" />
				<port id="11" precision="I32">
					<dim>1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="13" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="16" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="17" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Subtract_23143" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_23144" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="49" name="ReduceMax_23145" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="50" name="Constant_23146" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1902127" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="51" name="RaggedToDense_23147" type="RaggedToDense" version="extension">
			<data pad_right="true" m_pad_max_length="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Convert_23148" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Convert_23148.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="RaggedToDense_23147.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Result_23151" type="Result" version="opset1" output_names="input_ids">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="54" name="Result_23153" type="Result" version="opset1" output_names="attention_mask">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="46" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="46" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="46" to-port="3" />
		<edge from-layer="5" from-port="0" to-layer="46" to-port="4" />
		<edge from-layer="6" from-port="0" to-layer="46" to-port="5" />
		<edge from-layer="7" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="21" to-port="2" />
		<edge from-layer="8" from-port="2" to-layer="21" to-port="3" />
		<edge from-layer="8" from-port="3" to-layer="21" to-port="4" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="2" />
		<edge from-layer="12" from-port="3" to-layer="14" to-port="1" />
		<edge from-layer="12" from-port="3" to-layer="17" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="2" />
		<edge from-layer="14" from-port="3" to-layer="21" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="2" />
		<edge from-layer="19" from-port="3" to-layer="21" to-port="1" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="5" />
		<edge from-layer="21" from-port="10" to-layer="23" to-port="4" />
		<edge from-layer="21" from-port="11" to-layer="23" to-port="5" />
		<edge from-layer="21" from-port="8" to-layer="23" to-port="2" />
		<edge from-layer="21" from-port="7" to-layer="23" to-port="1" />
		<edge from-layer="21" from-port="6" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="9" to-layer="23" to-port="3" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="6" />
		<edge from-layer="23" from-port="7" to-layer="37" to-port="0" />
		<edge from-layer="23" from-port="8" to-layer="37" to-port="1" />
		<edge from-layer="23" from-port="9" to-layer="37" to-port="2" />
		<edge from-layer="23" from-port="10" to-layer="37" to-port="3" />
		<edge from-layer="23" from-port="11" to-layer="37" to-port="4" />
		<edge from-layer="24" from-port="0" to-layer="37" to-port="5" />
		<edge from-layer="25" from-port="0" to-layer="37" to-port="6" />
		<edge from-layer="26" from-port="0" to-layer="37" to-port="7" />
		<edge from-layer="27" from-port="0" to-layer="37" to-port="8" />
		<edge from-layer="28" from-port="0" to-layer="37" to-port="9" />
		<edge from-layer="29" from-port="0" to-layer="37" to-port="10" />
		<edge from-layer="30" from-port="0" to-layer="37" to-port="11" />
		<edge from-layer="31" from-port="0" to-layer="37" to-port="12" />
		<edge from-layer="32" from-port="0" to-layer="37" to-port="13" />
		<edge from-layer="33" from-port="0" to-layer="37" to-port="14" />
		<edge from-layer="34" from-port="0" to-layer="37" to-port="15" />
		<edge from-layer="35" from-port="0" to-layer="37" to-port="16" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="17" />
		<edge from-layer="37" from-port="19" to-layer="41" to-port="1" />
		<edge from-layer="37" from-port="20" to-layer="41" to-port="2" />
		<edge from-layer="37" from-port="18" to-layer="41" to-port="0" />
		<edge from-layer="38" from-port="0" to-layer="41" to-port="3" />
		<edge from-layer="39" from-port="0" to-layer="41" to-port="4" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="5" />
		<edge from-layer="41" from-port="6" to-layer="46" to-port="6" />
		<edge from-layer="41" from-port="7" to-layer="46" to-port="7" />
		<edge from-layer="41" from-port="8" to-layer="46" to-port="8" />
		<edge from-layer="42" from-port="0" to-layer="46" to-port="9" />
		<edge from-layer="43" from-port="0" to-layer="46" to-port="10" />
		<edge from-layer="44" from-port="0" to-layer="46" to-port="11" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="12" />
		<edge from-layer="46" from-port="14" to-layer="47" to-port="0" />
		<edge from-layer="46" from-port="13" to-layer="47" to-port="1" />
		<edge from-layer="46" from-port="13" to-layer="51" to-port="0" />
		<edge from-layer="46" from-port="14" to-layer="51" to-port="1" />
		<edge from-layer="46" from-port="15" to-layer="51" to-port="2" />
		<edge from-layer="47" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="1" />
		<edge from-layer="49" from-port="2" to-layer="51" to-port="3" />
		<edge from-layer="50" from-port="0" to-layer="51" to-port="4" />
		<edge from-layer="51" from-port="6" to-layer="52" to-port="0" />
		<edge from-layer="51" from-port="5" to-layer="55" to-port="0" />
		<edge from-layer="52" from-port="1" to-layer="53" to-port="0" />
		<edge from-layer="53" from-port="1" to-layer="54" to-port="0" />
		<edge from-layer="55" from-port="1" to-layer="56" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="50257" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="50257" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.3.0.0-593-a2c94833148" />
		<openvino_version value="2025.3.0-19719-dd1b9fc0747" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;TemplateProcessing&quot;, &quot;single&quot;: [{&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;|startoftranscript|>&quot;, &quot;type_id&quot;: 0}}, {&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;|notimestamps|>&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}, {&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;|endoftext|>&quot;, &quot;type_id&quot;: 0}}], &quot;pair&quot;: [{&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;|startoftranscript|>&quot;, &quot;type_id&quot;: 0}}, {&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;|notimestamps|>&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;A&quot;, &quot;type_id&quot;: 0}}, {&quot;Sequence&quot;: {&quot;id&quot;: &quot;B&quot;, &quot;type_id&quot;: 1}}, {&quot;SpecialToken&quot;: {&quot;id&quot;: &quot;&lt;|endoftext|>&quot;, &quot;type_id&quot;: 1}}], &quot;special_tokens&quot;: {&quot;&lt;|endoftext|>&quot;: {&quot;id&quot;: &quot;&lt;|endoftext|>&quot;, &quot;ids&quot;: [50257], &quot;tokens&quot;: [&quot;&lt;|endoftext|>&quot;]}, &quot;&lt;|notimestamps|>&quot;: {&quot;id&quot;: &quot;&lt;|notimestamps|>&quot;, &quot;ids&quot;: [50363], &quot;tokens&quot;: [&quot;&lt;|notimestamps|>&quot;]}, &quot;&lt;|startoftranscript|>&quot;: {&quot;id&quot;: &quot;&lt;|startoftranscript|>&quot;, &quot;ids&quot;: [50258], &quot;tokens&quot;: [&quot;&lt;|startoftranscript|>&quot;]}}}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.whisper.tokenization_whisper_fast.WhisperTokenizerFast'>" />
		<pad_token_id value="50257" />
		<processed_post_processor_template value="{&quot;single&quot;: {&quot;ids&quot;: [50258, 50363, -1, 50257], &quot;type_ids&quot;: [0, 0, 0, 0]}, &quot;pair&quot;: {&quot;ids&quot;: [50258, 50363, -1, -2, 50257], &quot;type_ids&quot;: [0, 0, 0, 1, 1]}}" />
		<sentencepiece_version value="0.2.0" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tiktoken_version value="0.11.0" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.4" />
		<transformers_version value="4.52.4" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
